wireless.org
* OSI reference model

** physical layer

- 802.3 Ethernet
- 802.11 wireless network

* 802.11

| protocol | year | frequency        |
|----------+------+------------------|
| 802.11a  | 1999 | 5 GHz            |
| 802.11b  | 1999 | 2.4 GHz          |
| 802.11g  | 2003 | 2.4 GHz          |
| 802.11n  | 2007 | 2.4 GHz or 5 GHz |
| 802.11ac |      |                  |

* BSS

one AP with station(s)
BSSID ( Basic Service Set IDentifier ), 48bit AP's MAC Address

* ESS

few AP share the same SSID
ESSID aka SSID

* frame

** frame type

*** control

RTS
CTS
ACK

*** data
*** management

Beacon
Probe requst & response
Authentication req & resp
Association req & resp

* beacon

AP cast

* passive connection

- beacon from AP to station
- auth req from station to AP
- auth resp from AP to station
- association req from station to AP
- association resp from AP to station

* active connection
  
- probe req from station to AP
- probe resp from AP to station
- auth req from station to AP
- auth resp from AP to station
- association req from station to AP
- association resp from AP to station

* roaming

below 30%

* RTS, CTS, Data then ACK but has IFS ( Inter Frame Space )

- RTS from station to AP
- CTS from AP to station
- Data from statino to AP
- ACk from AP to station

* rfc
* tools

- airbase-ng
- mdk3
- firesheep
- ippon
- aircrack-ng
- cowpatty
- scapy
- fuzzing
- file2air
- metasploit
- netstumbler
- kismet
- airsnort
- webcrack
- winsniffer
- airsnart
- hotspotter
- hostap
- smac
- airpwn
- webwedgie
- chopchop
- vippr
- irpass
- cdpsniffer
- airjack
- void11
- ike-crack
- wellenrighter

* security

- rogue AP

* one more thing

- virtual WIFI
- 802.11 vulnerabilities
- wpa enterprise
- hidden node
* link

http://www.technologyuk.net/telecommunications/networks/wireless_networks.shtmlhttp://www.technologyuk.net/telecommunications/networks/wireless_networks.shtml
https://supportforums.cisco.com/document/101431/80211-sniffer-capture-analysis-management-frames-and-open-auth
